sqliteSetup/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
        def all_users
            @users = User.all