sqliteSetup/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "age", "email", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "rajesh"], ["age", 20], ["email", "rajesh@test.com"], ["address", "delhi NCR"], ["created_at", "2023-08-11 06:32:40.996718"], ["updated_at", "2023-08-11 06:32:40.996718"]]
---
        def addUser
            @user = User.new(user_params)
          if @user.save

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
        def allUser
            user = User.all

DELETE FROM "users" WHERE (age > '34')
---
        def deleteUser
            @user = User.where('age >= ?', params[:id]).delete_all

SELECT AVG("users"."age") FROM "users"
---
        def avg
            averageAge = User.average(:age).to_f