proROR/app/controllers/users_controller.rb

  def delete_user
    @current_user ||= User.find_by(id: session[:user_id])

    if @current_user.nil?
      render json: {error: "Unauthorized", message: "you are not logged in"},status: :bad_request

      else
        if session[:user_id]== params[:id].to_i
          user = User.find_by(id: params[:id].to_i).destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]