proROR/app/controllers/users_controller.rb

  def create
    @user=User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "password", "confirmPassword", "email", "firstname", "lastname", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def allUser
  page_number = params[:page] || 1
  @users = User.paginate(page: page_number, per_page: 1)
---
SELECT "users".* FROM "users"

  def get_user
    user = User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]